Autodesk.Revit.DB.Grid.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Arc)
Creates a new radial grid line.
Remarks:
The arc should be on a horizontal plane.
document:
The document in which the new instance is created.
arc:
An arc object that represents the location of the new grid curve.
Returns:
The newly created grid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input arc is not on a horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Grid.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Line)
Creates a new grid line.
Remarks:
The line should be on a horizontal plane.
document:
The document in which the new instance is created.
line:
A line which represents the location of the grid line.
Returns:
The newly created grid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input line is not on a horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null